In [107]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import scipy.stats as ss

In [344]:
def cleanse(df):
    """
        This function takes a DataFrame, 
        cleans or prepares it and returns it 
        for further analysis
    """
    
    # Removing duplicate data
    df = df.drop_duplicates()
    
    # cleanse(slr)
    for col in df.columns:
        if df[col].isna().all():
            df.dropna()
    
    return df

In [366]:
slr = pd.read_csv("salaries.csv", index_col = 0)

# slr = pd.reIndex(inplace = True)

slr.reset_index(drop = False, inplace = True)

slr = cleanse(slr)

slr_usd = slr['salary_in_usd']

slr_usd.corr(slr.salary, method = "kendall")

0.9208317919034207

In [377]:
slr.describe()

         work_year        salary  salary_in_usd  remote_ratio
count  5129.000000  5.129000e+03    5129.000000   5129.000000
mean   2022.655098  1.884957e+05  144969.799571     44.531098
std       0.630861  5.951330e+05   67837.508198     48.634027
min    2020.000000  1.400000e+04   15000.000000      0.000000
25%    2022.000000  9.910000e+04   95000.000000      0.000000
50%    2023.000000  1.407000e+05  139500.000000      0.000000
75%    2023.000000  1.900000e+05  185700.000000    100.000000
max    2023.000000  3.040000e+07  615201.000000    100.000000

In [370]:
slr

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,EX,FT,Data Science Director,212000,USD,212000,US,0,US,M
1,2023,EX,FT,Data Science Director,190000,USD,190000,US,0,US,M
2,2023,MI,FT,Business Intelligence Engineer,35000,GBP,43064,GB,0,GB,M
4,2023,SE,FT,Machine Learning Engineer,245700,USD,245700,US,0,US,M
5,2023,SE,FT,Machine Learning Engineer,132300,USD,132300,US,0,US,M
...,...,...,...,...,...,...,...,...,...,...,...
8800,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
8801,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
8802,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
8803,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
8804,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L